# Panda

$\infty$
$sine(\theta)$
$x^2x^4$ + $\frac{1}{4}$

# Dealing with pandas.
Is said that 80% of data analysis is spent on the cleaning and preparing the data.To get it done we   usually use panda module. There are two common data structures, 
pandas can handle with. They are:
 1. **Series** - It is a 1d labeled array capable of holding any data type (integer, strings, float, python objects
    etc.). The axis labels are collectively referred to as index.
 2. **DataFrame** - It is 2d labeled array capable of holding any data type (integer, strings, float, python objects)
     with columns of potentially different types. We think of it like a spreadsheet, or SQL table, or a dict of series objects.

In [1]:
# importing modules
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# creating a DataFrame
# Make everything in lowercase to be in safe side
col_head = ["name","age","gender","job"]
user1 = pd.DataFrame([['alice',19,'F','student'],['john',26,'M','student']],columns=col_head)
print(user1)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [3]:
user2 = pd.DataFrame([["eric",22,'M','student'],['paul',58,'F','manager']],columns = col_head)
user2

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [4]:
user3 = pd.DataFrame(dict(name=['peter','julie'],age=[33,44],gender=['M','F'],job=['engineer','scientist']))
user3

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

In [5]:
dict(name=['peter','julie'],age=[33,44],gender=['M','F'],job=['engineer','scientist'])

{'name': ['peter', 'julie'],
 'age': [33, 44],
 'gender': ['M', 'F'],
 'job': ['engineer', 'scientist']}

In [6]:
# concatenate DataFrame
my_user = user1.append(user2,ignore_index=True)
my_user

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [7]:
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [8]:
user2

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [9]:
users =pd.concat([user1,user2,user3],ignore_index=True,sort=False)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [10]:
user4 = pd.DataFrame(dict(name=['alice','john','eric','julie'],height=[165,180,175,171]))
user4

    name  height
0  alice     165
1   john     180
2   eric     175
3  julie     171

In [11]:
print(users)
print(user4)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
    name  height
0  alice     165
1   john     180
2   eric     175
3  julie     171

In [12]:
# join dataframe #inner join - common name taken
merge_inter = pd.merge(users,user4,on='name')
merge_inter

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [13]:
#help(pd.merge)

In [14]:
#outer join 
merge_inter1 = pd.merge(users,user4,on='name',how='outer')
merge_inter1

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [15]:
user5 = pd.DataFrame(dict(name=['alice','john','eric','julie'],height=[165,180,175,171]))
user5

    name  height
0  alice     165
1   john     180
2   eric     175
3  julie     171

In [16]:
user6 = pd.DataFrame(dict( name=['alice','john','jenny','riya'],height=[16,18,17,17]))
user6

    name  height
0  alice      16
1   john      18
2  jenny      17
3   riya      17

In [17]:
merge_user =pd.merge(user5,user6,on='name')
merge_user
merge_user =pd.merge(user5,user6,on='name',how='outer')
merge_user

    name  height_x  height_y
0  alice     165.0      16.0
1   john     180.0      18.0
2   eric     175.0       NaN
3  julie     171.0       NaN
4  jenny       NaN      17.0
5   riya       NaN      17.0

In [26]:
#summarizing
#print(users)  #print first and last 30 rows
type(users)
users
#users.head()  #print first 5
#users.head(10)  #print first 10

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [19]:
users.describe()  #numeric columns

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [25]:
users.tail() #last 5

    name  age gender        job
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [22]:
users.describe(include='all')  #all columns top-with max freq

        name        age gender      job
count      6   6.000000      6        6
unique     6        NaN      2        4
top     paul        NaN      F  student
freq       1        NaN      3        3
mean     NaN  33.666667    NaN      NaN
std      NaN  14.895189    NaN      NaN
min      NaN  19.000000    NaN      NaN
25%      NaN  23.000000    NaN      NaN
50%      NaN  29.500000    NaN      NaN
75%      NaN  41.250000    NaN      NaN
max      NaN  58.000000    NaN      NaN

In [27]:
print(users.index)

RangeIndex(start=0, stop=6, step=1)

In [28]:
users.columns

Index(['name', 'age', 'gender', 'job'], dtype='object')

In [29]:
users.dtypes

name      object
age        int64
gender    object
job       object
dtype: object

In [30]:
users.shape

(6, 4)

In [31]:
users.values

array([['alice', 19, 'F', 'student'],
       ['john', 26, 'M', 'student'],
       ['eric', 22, 'M', 'student'],
       ['paul', 58, 'F', 'manager'],
       ['peter', 33, 'M', 'engineer'],
       ['julie', 44, 'F', 'scientist']], dtype=object)

In [33]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
name      6 non-null object
age       6 non-null int64
gender    6 non-null object
job       6 non-null object
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [35]:
#limit to one or more types
users.describe(include=['object'])

        name gender      job
count      6      6        6
unique     6      2        4
top     paul      F  student
freq       1      3        3

In [39]:
#column selection
users[['name']]

    name
0  alice
1   john
2   eric
3   paul
4  peter
5  julie

In [37]:
#multi column selection
users[['name','job']]

    name        job
0  alice    student
1   john    student
2   eric    student
3   paul    manager
4  peter   engineer
5  julie  scientist

In [40]:
ml=['name','age','job']
users[ml]

    name  age        job
0  alice   19    student
1   john   26    student
2   eric   22    student
3   paul   58    manager
4  peter   33   engineer
5  julie   44  scientist

In [64]:
#row selection #iloc is strictly position based
df=users.copy() #creating a copy of users
df.iloc[2,2]
df.iloc[2,0] ='anup'
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   anup   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [66]:
#increase al ages by 10
for i in range(df.shape[0]):
    r=df.iloc[i]
    r.age+=10
    df.iloc[i]=r
df

C:\Users\Dhriti Dhruve\Anaconda3\lib\site-packages\pandas\core\generic.py:4401: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

    name  age gender        job
0  alice   29      F    student
1   john   36      M    student
2   anup   32      M    student
3   paul   68      F    manager
4  peter   43      M   engineer
5  julie   54      F  scientist

In [70]:
#row selection/filtering
#simple logical filtering
users[users.age<10]

Empty DataFrame
Columns: [name, age, gender, job]
Index: []

In [72]:
young=users.age<20
print(young)
print(users[young])

0     True
1    False
2    False
3    False
4    False
5    False
Name: age, dtype: bool
    name  age gender      job
0  alice   19      F  student

In [78]:
#display one attribute from selected rows
users[users.age<20].job

0    student
Name: job, dtype: object

In [79]:
#using set membership
users[users.job.isin(['student','engineer'])]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [84]:
#using multiple conditions
users[(users.age>20)&(users.gender=='M')][['job','name','gender']]

        job   name gender
1   student   john      M
2   student   eric      M
4  engineer  peter      M

In [97]:
df=users.copy()
df.age.sort_values() #only for series

0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64

In [98]:
df.sort_values(by='age')

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student
4  peter   33      M   engineer
5  julie   44      F  scientist
3   paul   58      F    manager

In [99]:
df.sort_values(by='age',ascending=False)

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [100]:
#sort by multiple attributes
df.sort_values(by=['job','age'])

    name  age gender        job
4  peter   33      M   engineer
3   paul   58      F    manager
5  julie   44      F  scientist
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student

In [101]:
#modify df itself
print(df)
df.sort_values(by=['job','age'],inplace=True)
print(df)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
    name  age gender        job
4  peter   33      M   engineer
3   paul   58      F    manager
5  julie   44      F  scientist
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student

In [103]:
#reshaping by pivoting
#'unpivot' a dataframe from wide format to long(stacked) format
stacked=pd.melt(users,id_vars='name',var_name='variable',value_name='value')
print(stacked)

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          F
7    john   gender          M
8    eric   gender          M
9    paul   gender          F
10  peter   gender          M
11  julie   gender          F
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist

In [106]:
#'pivots' dataframe from long(stacked) format to wide format
print(stacked.pivot(index='name',columns='variable',values='value'))

variable age gender        job
name
alice     19      F    student
eric      22      M    student
john      26      M    student
julie     44      F  scientist
paul      58      F    manager
peter     33      M   engineer

In [121]:
#quality control : duplicate data
print(df)
df=users.append(users.iloc[0],ignore_index=True)
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
6  alice   19      F    student

In [122]:
print(df.duplicated().sum()) #count of duplicates 
print(df[df.duplicated()]) # only duplicates shown
print(df.age.duplicated()) #checking single column for duplicates
print(df.duplicated(['age','gender']).sum()) #specify columns for duplicates
df=df.drop_duplicates()
print(df)

1
    name  age gender      job
6  alice   19      F  student
0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: age, dtype: bool
1
    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist